luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_regdef.h
/** \brief  Destination Channels For Input Channel 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC1_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC1_DEST;

/** \brief  Read Address For Input Channel 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC2_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC2_ADDR;

/** \brief  Destination Channels For Input Channel 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC2_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC2_DEST;

/** \brief  Read Address For Input Channel 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC3_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC3_ADDR;

/** \brief  Destination Channels For Input Channel 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC3_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC3_DEST;

/** \brief  Read Address For Input Channel 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC4_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC4_ADDR;

/** \brief  Destination Channels For Input Channel 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC4_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC4_DEST;

/** \brief  Read Address For Input Channel 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC5_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC5_ADDR;

/** \brief  Destination Channels For Input Channel 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC5_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC5_DEST;

/** \brief  Read Address For Input Channel 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC6_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC6_ADDR;

/** \brief  Destination Channels For Input Channel 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC6_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC6_DEST;

/** \brief  Read Address For Input Channel 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC7_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC7_ADDR;

/** \brief  Destination Channels For Input Channel 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC7_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC7_DEST;

/** \brief  Read Address For Input Channel 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC8_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC8_ADDR;

/** \brief  Destination Channels For Input Channel 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC8_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC8_DEST;

/** \brief  Read Address For Input Channel 9 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC9_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC9_ADDR;

/** \brief  Destination Channels For Input Channel 9 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC9_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC9_DEST;

/** \brief  GTM to SPB BRIDGE MODE */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRIDGE_MODE_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_BRIDGE_MODE;

/** \brief  GTM to SPB BRIDGE PTR1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRIDGE_PTR1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_BRIDGE_PTR1;

/** \brief  GTM to SPB BRIDGE PTR2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRIDGE_PTR2_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_BRIDGE_PTR2;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_CLC_Bits B;                     /**< \brief Bitfield access */
} Ifx_GTM_CLC;

/** \brief  CMP Error Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_CMP_EIRQ_EN_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_CMP_EIRQ_EN;

/** \brief  CMP Comparator Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_CMP_EN_Bits B;                  /**< \brief Bitfield access */
} Ifx_GTM_CMP_EN;

/** \brief  CMP Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_CMP_IRQ_EN_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_CMP_IRQ_EN;

/** \brief  CMP Interrupt Force Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_CMP_IRQ_FORCINT_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_CMP_IRQ_FORCINT;

/** \brief  CMP IRQ Mode Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_CMP_IRQ_MODE_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_CMP_IRQ_MODE;

